# インストール先の指定
cask_args appdir: "/Applications"

# 外部ライブラリをインストール
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "trendyol/trendyol-tap"
tap "wez/wezterm"

# CLIアプリ
brew "bat"
brew "diff-so-fancy"
brew "direnv"
brew "duf"
brew "dust"
brew "fd"
brew "fzf"
brew "ghq"
brew "git"
brew "git-delta"
brew "gitui"
brew "ncurses"
brew "htop"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lolcat"
brew "neovim"
brew "node"
brew "nodenv"
brew "prettyping"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "starship"
brew "tealdeer"
brew "tig"
brew "tmux"
brew "tokei"
brew "tree"
brew "xsv"
brew "zoxide"

# GUIアプリ
cask "google-chrome"
cask "firefox"
cask "docker"
cask "font-hack-nerd-font"
cask "wezterm"
cask "postman"
cask "warp"
cask "karabiner-elements"
cask "iterm2"
cask "coteditor"
cask '1password'
cask 'gitup'
cask "raycast"
cask "fig"
